tap "av1155/scripts", "https://github.com/av1155/scripts.git"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "samtay/tui"
tap "supabase/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Highly capable, feature-rich programming language
brew "perl"
# Aquarium animation in ASCII art
brew "asciiquarium"
# ChatGPT in the terminal
brew "ata"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Pure Scala Artifact Fetching
brew "coursier"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Package manager for the Lua programming language
brew "luarocks"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Remote terminal application
brew "mosh"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package for scientific computing with Python
brew "numpy"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: true
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Paste PNG into files
brew "pngpaste"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Theme for zsh
brew "powerlevel10k"
# Bundle a Python application and all its dependencies
brew "pyinstaller"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Simple terminal image viewer written in Rust
brew "viu"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Easily compile and run Java files, manage cleanup, and view syntax-highlighted errors through a user-friendly fuzzy-finding menu.
brew "av1155/scripts/javaprojectmanager"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# Tetris in your terminal
brew "samtay/tui/tetris"
# Supabase CLI
brew "supabase/tap/supabase"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# View, create, manipulate, print and manage files in Portable Document Format
cask "adobe-acrobat-pro"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Display management tool
cask "betterdisplay"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Clipboard manager for developers
cask "flycut"
# Web browser
cask "google-chrome"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Utility that shows the latest app updates
cask "latest"
# Clipboard manager
cask "maccy"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Utility to extend trackpad functionality
cask "middleclick"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# App to write, plan, collaborate, and get organised
cask "notion"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Environment for statistical computing and graphics
cask "r"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Application to control your PlayStation 4 or PlayStation 5
cask "sony-ps-remote-play"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# SSH client
cask "termius"
# Unpacks archive files
cask "the-unarchiver"
# To-do & task list manager
cask "ticktick"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Bitwarden", id: 1352778147
mas "CleanMyMac X", id: 1339170533
mas "Dropover", id: 1355679052
mas "Encrypto", id: 935235287
mas "Final Cut Pro", id: 424389933
mas "Goodnotes", id: 1444383602
mas "Noir", id: 1592917505
mas "Sequel Ace", id: 1518036000
mas "Steam Link", id: 1246969117
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "catppuccin.catppuccin-vsc"
vscode "chakrounanas.turbo-console-log"
vscode "davidanson.vscode-markdownlint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "liviuschera.noctis"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "njpwerner.autodocstring"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "silesky.toggle-boolean"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wallabyjs.console-ninja"
vscode "wholroyd.jinja"
vscode "xaver.clang-format"
